[
  {
    "company": "Resilience Inc.,",
    "role": "Frontend Developer",
    "resps": [
      "Developing a climate refugee mobile app to connect communities with shelters, jobs, healthcare, and resources during natural disasters.",
      "Building end-to-end features in React Native, TypeScript, and Material UI, ensuring responsive, scalable, and user-friendly interfaces.",
      "Collaborating with designers and product managers to translate wireframes into functional flows, integrating APIs, and maintaining clean, reusable code.",
      "Contributing to accessibility, performance, and cross-platform optimization, supporting the app’s mission-critical use cases."
    ],
    "date": "July 2025 - Current"
  },
  {
    "company": "Skinstric AI",
    "role": "Frontend Engineer",
    "resps": [
      "Built a privacy-first skincare analysis platform using Next.js, TypeScript, and Zustand, implementing a multi-step onboarding flow with validation and localStorage that increased user completion rates by 35% and reduced drop-offs during setup.",
      "Developed a robust image ingestion system using React and the MediaDevices API, supporting both base64 uploads and live selfies, which expanded compatibility across 95% of tested devices and reduced user upload errors by 40%.",
      "Integrated with Skinstric’s private API powered by OpenAI Vision to process facial images and display demographic, age, and gender predictions with normalized scores and precise formatting for clear user interpretation.",
      "Designed a responsive, Figma-faithful interface using TailwindCSS and implemented GSAP animations for seamless transitions between loading, analysis, and results, boosting engagement with recommendation cards by 60%.",
      "Tuned client-server interactions and optimized Next.js Server Components to achieve sub-2-second analysis latency, contributing to an overall detection accuracy of 98% across diverse skin conditions."
    ],
    "date": "July 2025 - September 2025"
  },
  {
    "company": "Resilience Inc.,",
    "role": "UX Designer",
    "resps": [
      "Designed engaging and intuitive mobile user experiences for a climate refugee app, improving onboarding completion by 60% and significantly reducing user drop-offs.",
      "Translated complex workflows into wireframes, prototypes, and interactive mockups in Figma, cutting design-to-development cycles by 30%.",
      "Applied UX principles such as typography, color theory, and responsive layouts to deliver visually cohesive designs, leading to a 45% increase in user engagement with new features.",
      "Partnered with developers to align design solutions with feasibility and project goals, enabling a 25% faster rollout of mobile features."
    ],
    "date": "January 2025 - June 2025"
  },
  {
    "company": "Resilience Inc.,",
    "role": "AI Siftware Engineer",
    "resps": [
      "Enhanced AI-driven features for the AIMEE mobile app, improving app stability by 35% through new user-facing functionalities and critical bug fixes.",
      "Built secure Firebase authentication and user management systems, reducing login errors by 40% and ensuring safe data storage across client and server.",
      "Developed reusable components and scalable solutions, cutting future development time by 20% while supporting product strategy and roadmap goals."
    ],
    "date": "August 2024 - December 2024"
  }
]
